//==============================================================================
//C文件
#include "utPID.h"

//==============================================================================
//内部符号预定义

//==============================================================================
//内部调用变量

//==============================================================================
//内部调用函数定义

//==============================================================================
//外部调用函数

//==============================================================================
//外部调用函数


//##############################################################################
//
//##############################################################################
//------------------------------------------------------------------------------
void utInitPID(utPID_DATA *psPID)
{
	memset(psPID,0,sizeof(utPID_DATA));

	psPID->Kp = PID_Kp;
	psPID->Ki = PID_Ki;
	psPID->Kd = PID_Kd;
	psPID->umax = (PID_TYPE)PID_MAX;
}

void utPIDProc(utPID_DATA *sPID)
{
	PID_TYPE dUp,dUi,dUd,dUdtmp,dU,dUtmp;

	sPID->preErr = sPID->curErr;						//保存当前误差为先前误差
	sPID->curErr = sPID->set - sPID->uin;				//得到新的当前误差

	sPID->predErr = sPID->curdErr;						//保存当前误差变化为先前误差变化
	sPID->curdErr = sPID->curErr - sPID->preErr;		//得到新的当前误差变化

	dUp = sPID->curdErr;								//比例项为当前误差变化
	dUi = (sPID->Ki)*(sPID->curErr);					//积分项为积分系数乘以当前误差
	dUdtmp = (sPID->Kd)*((sPID->curdErr)-(sPID->predErr));	//微分项为当前误差变化减去先前误差变化

	#if (PID_UD_FILT_NUM > 1)							//有滤波，惯性环节在微分环节
	dUd = 1.0*(PID_UD_FILT_NUM-1)*(sPID->predUd)/PID_UD_FILT_NUM + 1.0*dUdtmp/PID_UD_FILT_NUM;
	(sPID->predUd) = dUd;
	#else
	dUd = dUdtmp;
	#endif

	dUtmp = (sPID->Kp)*(dUp+dUi+dUd);

	#if (PID_OUT_FILT_NUM > 1)							//有滤波，惯性环节在整个增量输出环节
	dU = 1.0*(PID_OUT_FILT_NUM-1)*(sPID->predU)/PID_OUT_FILT_NUM + 1.0*dUtmp/PID_OUT_FILT_NUM;
	#else
	dU = dUtmp;
	#endif

	(sPID->uout) += dU;

	if((sPID->uout) > (sPID->umax))						//正溢出修正
		(sPID->uout) = (sPID->umax);
	else if((sPID->uout) < (sPID->umin))				//负溢出修正
		(sPID->uout) = (sPID->umin);
}


//##############################################################################

//==============================================================================
//内部调用函数

//==============================================================================
//end of the file


//------------------------------------------------------------------------------  




