/***********************************************
FileName: motor_config.c
Author:   Tsui
Company:  SnowFlake
Version:  1.0
Date:     2015-1-6
Description: motor_config.c
	对4个轴的电机参数进行配置
Function List: 
	struct _m_motor_app_param motor_device_x 
	struct _m_motor_app_param motor_device_y
	struct _m_motor_app_param motor_device_z
	struct _m_motor_app_param motor_device_s
***********************************************/
#include "motor.h"

/* x轴电机参数 */
struct _m_motor_app_param motor_device_x = 
{
#if 1
    0.05000, /* ke */
	3.6,     /* 相电感 */
	1.5,     /* 相电阻 */
	1,       /* 相电阻温度补偿 */

	1.0,     /* 锁定电流 A r.m.s */
	1.3,     /* 加速度电流 A r.m.s */
	1.3,     /* 减速电流 A r.m.s */
	1.3,     /* 恒速运行电流 A r.m.s */

	900.0,   /* 加速度 step/s^2 */
	900.0,   /* 减速度 step/s^2 */
	
	800.0,  /* 最高速度 step/s */
	100.0,   /* 最低速度 */
	2000.0,  /* 阈值速度 */

	2000,    /* 失步电流 */
	dSPIN_OCD_TH_3000mA,   /* 电流阈值 */
	dSPIN_STEP_SEL_1_64,  /* 细分值 */
#endif

#if 0
	0.01742, /* ke */
	3.6,	 /* 相电感 */
	1.0,	 /* 相电阻 */
	1,		 /* 相电阻温度补偿 */

	0.6,	 /* 锁定电流 A r.m.s */
	1.0,	 /* 加速度电流 A r.m.s */
	1.0,	 /* 减速电流 A r.m.s */
	1.0,	 /* 恒速运行电流 A r.m.s */

	100.0,	 /* 加速度 step/s^2 */
	800.0,	 /* 减速度 step/s^2 */

	800.0,	  /* 最高速度 step/s */
	100.0,	   /* 最低速度 */
	2500.0,   /* 阈值速度 */

	1400,	 /* 失步电流 */
	dSPIN_OCD_TH_2625mA,   /* 电流阈值 */
	dSPIN_STEP_SEL_1_64,   /* 细分值 */
#endif

};

/* y轴电机参数 */
struct _m_motor_app_param motor_device_y = 
{
#if 0
	/* 中生电机 */
    0.01742, /* ke */
	12.8,    /* 相电感 */
	4.2,     /* 相电阻 */
	1,       /* 相电阻温度补偿 */

	1.0,     /* 锁定电流 A r.m.s */
	1.2,     /* 加速度电流 A r.m.s */
	1.2,     /* 减速电流 A r.m.s */
	1.2,     /* 恒速运行电流 A r.m.s */

	12000.0,   /* 加速度 step/s^2 */
	12000.0,   /* 减速度 step/s^2 */
	
	1000.0,    /* 最高速度 step/s */
	100.0,     /* 最低速度 */
	2500.0,   /* 阈值速度 */

	1600,    /* 失步电流 */
	dSPIN_OCD_TH_2625mA,   /* 电流阈值 */
	dSPIN_STEP_SEL_1_16,   /* 细分值 */
#endif
	0.01742, /* ke */
	3.6,	 /* 相电感 */
	1.0,	 /* 相电阻 */
	1,		 /* 相电阻温度补偿 */

	1.0,	 /* 锁定电流 A r.m.s */
	1.0,	 /* 加速度电流 A r.m.s */
	1.0,	 /* 减速电流 A r.m.s */
	1.0,	 /* 恒速运行电流 A r.m.s */

	400.0,   /* 加速度 step/s^2 */
	800.0,   /* 减速度 step/s^2 */

	800.0,    /* 最高速度 step/s */
	100.0,	   /* 最低速度 */
	2500.0,   /* 阈值速度 */

	1400,	 /* 失步电流 */
	dSPIN_OCD_TH_2625mA,   /* 电流阈值 */
	dSPIN_STEP_SEL_1_64,   /* 细分值 */
};

/* z轴电机参数 */
struct _m_motor_app_param motor_device_z = 
{
#if 0
	0.01742, /* ke */
	7.2,     /* 相电感 */
	11,      /* 相电阻 */
	1,       /* 相电阻温度补偿 */

	0.8,     /* 锁定电流 A r.m.s */
	1.1,     /* 加速度电流 A r.m.s */
	1.1,     /* 减速电流 A r.m.s */
	1.1,     /* 恒速运行电流 A r.m.s */

	600.0,   /* 加速度 step/s^2 */
	600.0,   /* 减速度 step/s^2 */
	
	900.0,   /* 最高速度 step/s */
	100.0,   /* 最低速度 */
	1000.0,  /* 阈值速度 */

	700,     /* 失步电流 */
	dSPIN_OCD_TH_750mA,  /* 电流阈值 */
	dSPIN_STEP_SEL_1_4,  /* 细分值 */
#endif
	0.01742, /* ke */
	3.6,	 /* 相电感 */
	1.0,	 /* 相电阻 */
	1,		 /* 相电阻温度补偿 */

	1.0,	 /* 锁定电流 A r.m.s */
	1.0,	 /* 加速度电流 A r.m.s */
	1.0,	 /* 减速电流 A r.m.s */
	1.0,	 /* 恒速运行电流 A r.m.s */

	400.0,	 /* 加速度 step/s^2 */
	800.0,	 /* 减速度 step/s^2 */

	800.0,	  /* 最高速度 step/s */
	100.0,	   /* 最低速度 */
	2500.0,   /* 阈值速度 */

	1400,	 /* 失步电流 */
	dSPIN_OCD_TH_2625mA,   /* 电流阈值 */
	dSPIN_STEP_SEL_1_64,   /* 细分值 */
};
/*****************************@ ShowFlake @*******************************/
