//==============================================================================
//C文件
//与硬件无关的常用库函数
#include "utFIFO.h"

//==============================================================================
//内部符号预定义

//==============================================================================
//内部调用变量

//==============================================================================
//内部调用函数定义

//==============================================================================
//外部调用函数

//==============================================================================
//外部调用函数


//##############################################################################
//模块
//##############################################################################
//------------------------------------------------------------------------------

//初始化长度及清空FIFO
void utInitFIFO(UT_FIFO *pFifo,FIFO_LEN_TYPE maxLen)
{
	(pFifo->maxLen) = maxLen;
	utClrFIFO (pFifo);
}

//清空FIFO
void utClrFIFO(UT_FIFO *pFifo)
{
	(pFifo->pHead) = 0;
	(pFifo->pTail) = 0;
	(pFifo->cnt) = 0;
}

//得到可以写的索引号
FIFO_LEN_TYPE utIndWrtFIFO(UT_FIFO *pFifo)
{
	FIFO_LEN_TYPE ind;

	ind = (pFifo->pHead);
									
	if(++(pFifo->pHead)==(pFifo->maxLen))
		(pFifo->pHead)=0;
	
	(pFifo->cnt)++;

	return ind;	
}

//得到可以读的序列号
FIFO_LEN_TYPE utIndRdFIFO(UT_FIFO *pFifo)
{
	FIFO_LEN_TYPE ind;
	
	ind = (pFifo->pTail);
	
	if(++(pFifo->pTail)==(pFifo->maxLen))
		(pFifo->pTail)=0;

	(pFifo->cnt)--;
	
	return ind;
}

//预查询第N个位置上的元素
FIFO_LEN_TYPE utIndRdNFIFO(UT_FIFO *pFifo, FIFO_LEN_TYPE n)
{
	FIFO_LEN_TYPE ind;

	ind = (pFifo->pTail);
	
	if(n>=pFifo->cnt)						//位置不对，返回0
		return 0;
	else if((ind + n) >= (pFifo->maxLen))	//超出
		return ((ind + n)-(pFifo->maxLen));
	else 									//
		return (ind + n);	
}
//##############################################################################

//==============================================================================
//内部调用函数

//==============================================================================
//end of the file


//------------------------------------------------------------------------------  




