//==============================================================================
//C文件
//与硬件无关的常用库函数
#include "utSPI.h"

//==============================================================================
//内部符号预定义

//==============================================================================
//内部调用变量

//==============================================================================
//内部调用函数定义

//==============================================================================
//外部调用函数

//==============================================================================
//外部调用函数


//##############################################################################
//模块
//##############################################################################
//------------------------------------------------------------------------------
void utSPIWrt(INT8U dat)		//MOSI，MISO复用，本函数单写
{
	INT8U i;

	//开始之前CLK = 0
	for (i = 0; i < 8; i++)
	{
		//送出,先把数据放好，再来上升沿
		if (dat & BIT7)
			utSPIOut(1);
		else
			utSPIOut(0);

		utSPIClk(1); 	//写数	
		utSPIClk(0); 	//下一次
		dat <<= 1; 		//把下一次要写的数准备好
	}
}

INT8U utSPIRd(void)			//MOSI，MISO复用，本函数单读
{
	INT8U rdat = 0;
	INT8U i;
	
	//开始之前CLK = 0
	for (i = 0; i < 8; i++)
	{
		//第一次出来是利用的CS的下降沿，第二次是用上一个字节最后一个CLK的下降沿
		rdat <<= 1; //把位空出来
		if (utIsSPIIn())
			rdat |= BIT0;

		utSPIClk(1);	//上升沿写数	
		utSPIClk(0);	//下降沿出数
	}

	return rdat;
}

#if 0
INT8U utRdSPIByte(INT8U addr)
{
	INT8U cbus_byte;

	#if 0
	addr <<= 1;
	addr |= BIT7;

	RC531CSN = 0; 		// Clear CSN
	utLoadSPI(addr); 	// Load CBUS address byte
	cbus_byte = utLoadSPI(0x00); // Read CBUS byte
	RC531CSN = 1; 		// Set CSN
	#endif

	return (cbus_byte); // Return CBUS Byte
}

void utWrSPIByte(INT8U addr, INT8U dat)
{
	#if 0
	addr <<= 1;

	RC531CSN = 0; 		// Clear CSN
	utLoadSPI(addr); 	// Load CBUS address byte
	utLoadSPI(dat); 	// Read CBUS byte
	RC531CSN = 1; 		// Set CSN
	#endif
}
#endif

//##############################################################################

//==============================================================================
//内部调用函数

//==============================================================================
//end of the file


//------------------------------------------------------------------------------  




